import requests

if __name__ == "__main__":
    # Отправляем запрос на сервер с набором данных
    r = requests.post("http://localhost:5000/add",
        json=[0.0, 4.0, 2286.0, 3.0, 3.0, 1.0, 1.0, 1.0, 15.0, 3.0, 0.0, 1.0, 1.4, 10.0, 7.5, 1.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0])
    
    print('Статус сервера:', r.status_code)
    
    # Получаем предсказание стоимости недвижимости
    if r.status_code == 200:
        print("Ответ сервера - предсказание:", r.json()["result"])
    else:
        print("Ответ сервера:", r.text)
        
        
